In [1]:
import os
import sys
import json

import pandas as pd
import sqlalchemy

## Задание 0. Чтение файла

In [2]:
PATH_TO_FILE: str = os.path.join("..", "test_task.jsonl")
PATH_TO_FILE

'..\\test_task.jsonl'

In [3]:
data = []
with open(PATH_TO_FILE, 'r') as f:
    for line in f:
        data.append(json.loads(line))

# Создание DataFrame
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  10000 non-null  object
 1   log_level  10000 non-null  object
 2   user_id    10000 non-null  int64
 3   action     10000 non-null  object
 4   amount     2488 non-null   float64
 5   status     10000 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 468.9+ KB

In [4]:
df.head()

,timestamp,log_level,user_id,action,amount,status
0,2025-07-04T01:49:20.843324-04:00,ERROR,4174,logout,NaN,success
1,2025-06-27T22:30:23.843324+01:00,INFO,4507,purchase,51.27,pending
2,2025-06-26T13:43:42.843324-04:00,ERROR,1860,login,NaN,pending
3,2025-06-27T16:39:18.843324+00:00,INFO,2294,purchase,47.11,pending
4,2025-07-03T22:31:40.843324+00:00,ERROR,2130,logout,NaN,pending

## Задание 1. Поиск пустых строк и дубликатов

### Поиск пустых строк

In [5]:
df.describe()

            user_id       amount
count  10000.000000  2488.000000
mean    3010.561100   253.945623
std     1152.371939   144.864747
min     1000.000000     0.310000
25%     2001.750000   134.150000
50%     3004.000000   253.550000
75%     4010.000000   380.040000
max     4999.000000   499.960000

In [6]:
df.isnull().sum()

timestamp       0
log_level       0
user_id         0
action          0
amount       7512
status          0
dtype: int64

In [7]:
df[df["amount"].isna()].head(10)

,timestamp,log_level,user_id,action,amount,status
0,2025-07-04T01:49:20.843324-04:00,ERROR,4174,logout,NaN,success
2,2025-06-26T13:43:42.843324-04:00,ERROR,1860,login,NaN,pending
4,2025-07-03T22:31:40.843324+00:00,ERROR,2130,logout,NaN,pending
6,2025-07-05T11:41:07.843324-04:00,ERROR,4772,logout,NaN,success
7,2025-07-02T17:30:27.843324-04:00,INFO,4092,logout,NaN,pending
9,2025-07-04T03:21:13.843324-04:00,INFO,3169,error,NaN,fail
10,2025-06-27T12:00:08.843324-04:00,WARN,1466,login,NaN,success
11,2025-06-28T08:01:35.843324+09:00,ERROR,2238,error,NaN,pending
12,2025-06-29T15:18:06.843324+01:00,INFO,1330,error,NaN,success
14,2025-06-28T21:30:53.843324+09:00,INFO,3135,login,NaN,success

In [8]:
df[df["amount"].isna()]["action"].unique()

array(['logout', 'login', 'error'], dtype=object)

In [9]:
df["action"].unique()

array(['logout', 'purchase', 'login', 'error'], dtype=object)

In [10]:
# Пропуски есть в поле amount, но в поле amount самое минимальное значение это -0.31. 
# Пропуски присутствуют в 3 из 4-х возможных вариантов action
# Причем поле purchase всегда заполнено. В переводе с английского purchase - это покупка.
# Логично что поле с покупкой должно быть всегда не 0. 
# Для целостности заменим все NaN значения в поле amount на 0

In [11]:
df["amount"] = df["amount"].fillna(0)

In [12]:
df.isnull().sum()

timestamp    0
log_level    0
user_id      0
action       0
amount       0
status       0
dtype: int64

In [13]:
# Больше нет пустых ячеек

### Поиск дублей

In [14]:
df.duplicated().sum()

np.int64(0)

In [15]:
# Полных дубликатов нет

In [16]:
df.duplicated(subset=["timestamp", "user_id"]).sum()

np.int64(0)

In [17]:
# Нет ни полных дублей, нет дублей в паре дата-время и user_id. Остальные поля можно опустить
# Нет полнстью пустых строк. Есть nan только в 1 поле

In [18]:
# Набор функций, который позволят избавиться и от полных дублей и от полностью пустых строк.
df_clean = (
    df[~df.isna()]              # Удалит NaN строки
    .drop_duplicates()          # Удалить дубликаты
    .reset_index(drop=True)     # Сбросить индексы
)

df_clean.shape

(10000, 6)

## Задание 2. Привести даты к UTC формату

In [19]:
df_clean.head(2)

,timestamp,log_level,user_id,action,amount,status
0,2025-07-04T01:49:20.843324-04:00,ERROR,4174,logout,0.00,success
1,2025-06-27T22:30:23.843324+01:00,INFO,4507,purchase,51.27,pending

In [20]:
df_clean['timestamp'] = pd.to_datetime(df_clean['timestamp'], utc=True)
df_clean.head(2)

,timestamp,log_level,user_id,action,amount,status
0,2025-07-04 05:49:20.843324+00:00,ERROR,4174,logout,0.00,success
1,2025-06-27 21:30:23.843324+00:00,INFO,4507,purchase,51.27,pending

In [21]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  10000 non-null  datetime64[ns, UTC]
 1   log_level  10000 non-null  object
 2   user_id    10000 non-null  int64
 3   action     10000 non-null  object
 4   amount     10000 non-null  float64
 5   status     10000 non-null  object
dtypes: datetime64[ns, UTC](1), float64(1), int64(1), object(3)
memory usage: 468.9+ KB

## Задание 3. Отфильтровать только status = 'success'.

In [22]:
df_clean = df_clean[df_clean['status'] == "success"]
df_clean.shape

(3408, 6)

## Задание 4. Подготовить финальную таблицу transactions_clean с полями:
- transaction_id
- user_id
- amount_usd
- created_at_utc

In [23]:
df_final = df_clean[["user_id", "amount", "timestamp"]]
df_final = df_final.rename(
    columns = {
        "amount" : "amount_usd",
        "timestamp" : "created_at_utc",
    }
).reset_index(drop = True)
df_final

      user_id  amount_usd                   created_at_utc
0        4174        0.00 2025-07-04 05:49:20.843324+00:00
1        4772        0.00 2025-07-05 15:41:07.843324+00:00
2        1466        0.00 2025-06-27 16:00:08.843324+00:00
3        1330        0.00 2025-06-29 14:18:06.843324+00:00
4        3135        0.00 2025-06-28 12:30:53.843324+00:00
...       ...         ...                              ...
3403     4289        0.00 2025-06-30 05:19:50.843324+00:00
3404     4235        0.00 2025-07-01 18:47:27.843324+00:00
3405     2184      326.03 2025-06-30 12:10:37.843324+00:00
3406     1942        0.00 2025-06-28 16:08:18.843324+00:00
3407     4113      283.46 2025-06-26 20:39:22.843324+00:00

[3408 rows x 3 columns]

In [24]:
# Поскольку нет конкретного указания по какому правил формировать ID можно пойти 2 вариантами:
#  1 - нарастающее целочисленное значение с первой записи 
#  2 - случайное целочисленное значение без привязки к порядку

In [25]:
import uuid

df_final_variant_rangeindex = df_final.copy(deep=True)
df_final_variant_randomindex = df_final.copy(deep=True)

df_final_variant_rangeindex['transaction_id'] = pd.RangeIndex(start=1, stop=len(df_final_variant_rangeindex) + 1)
df_final_variant_randomindex["transaction_id"] = [str(uuid.uuid4()) for _ in range(len(df_final_variant_randomindex))]

In [26]:
df_final_variant_rangeindex = df_final_variant_rangeindex[
    [
        "transaction_id",
        "user_id",
        "amount_usd",
        "created_at_utc",
    ]
]

df_final_variant_rangeindex.head()

   transaction_id  user_id  amount_usd                   created_at_utc
0               1     4174         0.0 2025-07-04 05:49:20.843324+00:00
1               2     4772         0.0 2025-07-05 15:41:07.843324+00:00
2               3     1466         0.0 2025-06-27 16:00:08.843324+00:00
3               4     1330         0.0 2025-06-29 14:18:06.843324+00:00
4               5     3135         0.0 2025-06-28 12:30:53.843324+00:00

In [27]:
df_final_variant_randomindex = df_final_variant_randomindex[
    [
        "transaction_id",
        "user_id",
        "amount_usd",
        "created_at_utc",
    ]
]

df_final_variant_randomindex.head()

,transaction_id,user_id,amount_usd,created_at_utc
0,e0805cdf-8d07-4ab8-9acb-8378e673facf,4174,0.0,2025-07-04 05:49:20.843324+00:00
1,20e73410-2328-4611-999b-6b4e003d7177,4772,0.0,2025-07-05 15:41:07.843324+00:00
2,75e6c576-b617-4a8f-a306-d7bee71cf290,1466,0.0,2025-06-27 16:00:08.843324+00:00
3,7b965d74-e705-4fde-bc5e-616cfc0cdcba,1330,0.0,2025-06-29 14:18:06.843324+00:00
4,0d540939-149a-408a-b743-bc2ebc11aade,3135,0.0,2025-06-28 12:30:53.843324+00:00

## Загрузка таблицы в БД

In [37]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, text

# Формат строки подключения: postgresql://user:password@host:port/database
DATABASE_URL = "postgresql://admin:admin@localhost:5432/landing"

# Создаём движок SQLAlchemy
engine = create_engine(DATABASE_URL)

### df_final_variant_rangeindex

In [38]:
create_table_df_final_variant_rangeindex = text("""
CREATE TABLE IF NOT EXISTS df_final_variant_rangeindex (
    transaction_id SERIAL PRIMARY KEY,
    user_id INTEGER,
    amount_usd FLOAT,
    created_at_utc TIMESTAMP
);
""")

# Выполнение запроса
with engine.connect() as connection:
    connection.execute(create_table_df_final_variant_rangeindex)
    connection.commit()

In [39]:
df_final_variant_rangeindex.to_sql('df_final_variant_rangeindex', engine, if_exists='replace', index=False)

408

### df_final_variant_randomindex

In [40]:
create_table_df_final_variant_randomindex = text("""
CREATE TABLE IF NOT EXISTS df_final_variant_randomindex (
    transaction_id SERIAL PRIMARY KEY,
    user_id INTEGER,
    amount_usd FLOAT,
    created_at_utc TIMESTAMP
);
""")

# Выполнение запроса
with engine.connect() as connection:
    connection.execute(create_table_df_final_variant_randomindex)
    connection.commit()

In [41]:
df_final_variant_randomindex.to_sql('df_final_variant_randomindex', engine, if_exists='replace', index=False)

408

## Задание 5. Написать SQL, который посчитает Total Amount USD по дням.

In [44]:
total_amount_usd_per_date: str = """
SELECT 
    DATE(created_at_utc) AS date_at
    , SUM(amount_usd) AS sum_usd
    
    FROM df_final_variant_randomindex
        GROUP BY DATE(created_at_utc)
            ORDER BY DATE(created_at_utc)
"""
result = pd.read_sql(total_amount_usd_per_date, engine)
result

       date_at   sum_usd
0   2025-06-25   2846.97
1   2025-06-26  19635.27
2   2025-06-27  14774.49
3   2025-06-28  22885.27
4   2025-06-29  17058.25
5   2025-06-30  16013.42
6   2025-07-01  16775.19
7   2025-07-02  17369.47
8   2025-07-03  19997.22
9   2025-07-04  17628.05
10  2025-07-05  18512.24
11  2025-07-06  17689.43
12  2025-07-07   5748.50

## Задание 6. Вывести 5 последних дат с суммой.

In [45]:
last_five_dates_with_sum: str = """
SELECT 
    DATE(created_at_utc) AS transaction_date,
    SUM(amount_usd) AS total_amount
    
    FROM df_final_variant_rangeindex
        GROUP BY DATE(created_at_utc)
            ORDER BY transaction_date DESC
    LIMIT 5;
"""
result = pd.read_sql(last_five_dates_with_sum, engine)
result

  transaction_date  total_amount
0       2025-07-07       5748.50
1       2025-07-06      17689.43
2       2025-07-05      18512.24
3       2025-07-04      17628.05
4       2025-07-03      19997.22